DataProcessors/НачальнаяСтраница.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DataProcessor>
		<Properties>
			<Name>НачальнаяСтраница</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Documents/Задача.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>Задача</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СостоянияЗадач</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеЗадачи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеЗадачи</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПостановщикЗадачи</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроектГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокЗадачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетВремени</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоОтсчетаВремени</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончаниеОтсчетаВремени</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоШаблон</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтоимостьЗадачи</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтчетныйПериод</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдПисьма</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заказчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контакты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗавершенияФакт</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗавершенияПлан</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗатраченоЧасовФакт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗатраченоЧасовПлан</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентВыполнения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Подзадачи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Подзадача</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Выполнена</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Работы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Работа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Время</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Стоимость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

DataProcessors/НачальнаяСтраница/Forms/Форма/Ext/Form/Module.bsl
Процедура ОбновитьДеревоВручную()
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Задача.Ссылка КАК Задача,
	|	Задача.ПроектГруппа КАК Проект,
	|	ВЫБОР
	|		КОГДА Задача.Состояние = ЗНАЧЕНИЕ(Справочник.СостоянияЗадач.Завершена)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Выполнена,
	|	Задача.Ответственный КАК Ответственный,
	|	Задача.СрокЗадачи КАК СрокЗадачи,
	|	Задача.ЗатраченоЧасовПлан КАК ПланВремя,
	|	Задача.ДатаЗавершенияПлан КАК ПланСдачи,
	|	Задача.Состояние КАК Статус,
	|	Задача.НаименованиеЗадачи КАК Наим,
	|	Задача.СтоимостьЗадачи КАК Стоимость,
	|	Задача.ПроцентВыполнения КАК ПроцентВыполнения
	|ИЗ
	|	Документ.Задача КАК Задача
	|ГДЕ
	|	1 = 1
	|	И 2 = 2
	|	И НЕ Задача.ПометкаУдаления
	|	И ВЫБОР
	|			КОГДА &ВыводитьЗавершенные
	|				ТОГДА 1 = 1
	|			ИНАЧЕ Задача.Состояние <> ЗНАЧЕНИЕ(Справочник.СостоянияЗадач.Завершена)
	|		КОНЕЦ
	|ИТОГИ ПО
	|	Проект";
	
	Запрос.Параметры.Вставить("ВыводитьЗавершенные", ВыводитьЗавершенные);
	Если ЗначениеЗаполнено(Проект) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "1 = 1", "Задача.ПроектГруппа = &ПроектГруппа");
		Запрос.Параметры.Вставить("ПроектГруппа", Проект);
	КонецЕсли; 
	Если ЗначениеЗаполнено(ДатаЗапроса) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "2 = 2", "Задача.СрокЗадачи МЕЖДУ &НачДата И &КонДата");
		Запрос.Параметры.Вставить("НачДата", НачалоДня(ДатаЗапроса.ДатаНачала));
		Запрос.Параметры.Вставить("КонДата", КонецДня(ДатаЗапроса.ДатаОкончания));
	КонецЕсли; 
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаПроект = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ДеревоОбъект = РеквизитФормыВЗначение("Дерево");
	ДеревоОбъект.Строки.Очистить();
	
	Пока ВыборкаПроект.Следующий() Цикл
		СтрокаПроект = ДеревоОбъект.Строки.Добавить();
		СтрокаПроект.Наим = ВыборкаПроект.Проект;
		Выборка = ВыборкаПроект.Выбрать();
		Пока Выборка.Следующий() Цикл
			СтрокаЗадача = СтрокаПроект.Строки.Добавить();
			СтрокаЗадача.Задача = Выборка.Задача;
			СтрокаЗадача.Наим = Выборка.Наим;
			СтрокаЗадача.Выполнено = Выборка.Выполнена;
			СтрокаЗадача.Ответственный = Выборка.Ответственный;
			СтрокаЗадача.СрокЗадачи = Выборка.СрокЗадачи;
			СтрокаЗадача.ПланСдачи = Выборка.ПланСдачи;
			СтрокаЗадача.Стоимость = Выборка.Стоимость;
			СтрокаЗадача.Статус = Выборка.Статус;
			СтрокаЗадача.ПроцентВыполнения = Выборка.ПроцентВыполнения;
			СтрокаЗадача.ПланВремя = Выборка.ПланВремя;
		КонецЦикла; 
	КонецЦикла;	
	
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	Задача.Ссылка КАК Задача,
	//|	Задача.НаименованиеЗадачи КАК Наим,
	//|	Задача.Состояние КАК Статус,
	//|	Задача.ПроектГруппа.Наименование КАК Проект
	//|ИЗ
	//|	Документ.Задача КАК Задача
	//|ГДЕ
	//|	НЕ Задача.ПометкаУдаления
	//|
	//|УПОРЯДОЧИТЬ ПО
	//|	Задача.Состояние.Код
	//|ИТОГИ ПО
	//|	Статус";
	//РезультатЗапроса = Запрос.Выполнить();
	//
	//ВыборкаСтатус = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	//
	//ДеревоСтатусовОбъект = РеквизитФормыВЗначение("ДеревоСтатусов");
	//ДеревоСтатусовОбъект.Строки.Очистить();
	//
	//Пока ВыборкаСтатус.Следующий() Цикл
	//	СтрокаСтатус = ДеревоСтатусовОбъект.Строки.Добавить();
	//	СтрокаСтатус.Задача = ВыборкаСтатус.Статус;
	//	СтрокаСтатус.Наим = ВыборкаСтатус.Статус;
	//	Выборка = ВыборкаСтатус.Выбрать();
	//	Пока Выборка.Следующий() Цикл
	//		СтрокаЗадача = СтрокаСтатус.Строки.Добавить();
	//		СтрокаЗадача.Задача = Выборка.Задача;
	//		СтрокаЗадача.Наим = "[" + Выборка.Проект + "] " + Выборка.Наим;
	//	КонецЦикла; 
	//КонецЦикла;	
	//
	ЗначениеВРеквизитФормы(ДеревоОбъект, "Дерево");
	//ЗначениеВРеквизитФормы(ДеревоСтатусовОбъект, "ДеревоСтатусов");
	
КонецПроцедуры

&НаКлиенте
Процедура РаскрытьВетвиДерева()
	
	ЭлементыДерева = Дерево.ПолучитьЭлементы();
    Для каждого ЭлементДерева Из ЭлементыДерева Цикл
        Элементы.Дерево.Развернуть(ЭлементДерева.ПолучитьИдентификатор());
		Если ЭлементДерева.СрокЗадачи <> Дата(1,1,1) И ЭлементДерева.СрокЗадачи < ТекущаяДата() Тогда
			Элементы.Дерево.ЦветФона = WebЦвета.Красный;
		КонецЕсли; 
    КонецЦикла;
	
	//ЭлементыДерева = ДеревоСтатусов.ПолучитьЭлементы();
	//Для каждого ЭлементДерева Из ЭлементыДерева Цикл
	//    Элементы.ДеревоСтатусов.Развернуть(ЭлементДерева.ПолучитьИдентификатор());
	//КонецЦикла;
	
КонецПроцедуры
 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбновитьДеревоВручную();
	
КонецПроцедуры

&НаКлиенте
Процедура ФлажокПриИзменении(Элемент)
	
	ИДТекущейСтроки = Элементы["Дерево"].ТекущаяСтрока;
	
	Если ИДТекущейСтроки <> Неопределено Тогда
		
		ЭлементКоллекции = ЭтаФорма["Дерево"].НайтиПоИдентификатору(ИДТекущейСтроки);
		
		//Если ЭлементКоллекции.Выполнено Тогда
		//	ЭлементКоллекции.Выполнено = Ложь;
		//КонецЕсли;
		
		УстановкаФлажков(ЭлементКоллекции, ЭлементКоллекции.Выполнено);
		
		Родитель = ЭлементКоллекции.ПолучитьРодителя();
		Пока Родитель <> Неопределено Цикл
			Родитель.Выполнено = ?(УстановленноДляВсех(ЭлементКоллекции), Истина, Ложь);
			Родитель.Выполнено = ?(СнятоДляВсех(ЭлементКоллекции), Истина, Ложь);
			ЭлементКоллекции = Родитель;
			Родитель = ЭлементКоллекции.ПолучитьРодителя();
		КонецЦикла;
		
	КонецЕсли;
	
	ОбновитьДеревоВручную();
	РаскрытьВетвиДерева();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановкаФлажков(ЭлементКоллекции, ЗначениеПометки)
	
	ЗадачаВыполнена(ЭлементКоллекции.Задача);
	ПодчинЭлементы = ЭлементКоллекции.ПолучитьЭлементы();
	Для Каждого ТекЭлемент Из ПодчинЭлементы Цикл
		ТекЭлемент.Выполнено = ЗначениеПометки;
		ЗадачаВыполнена(ТекЭлемент.Задача);
		УстановкаФлажков(ТекЭлемент, ТекЭлемент.Выполнено);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗадачаВыполнена(ЗадачаСсылка)
	
	ЗадачаОбъект = ЗадачаСсылка.ПолучитьОбъект();
	ЗадачаОбъект.Состояние = Справочники.СостоянияЗадач.Завершена;
	ЗадачаОбъект.Записать();
	
КонецПроцедуры
 

&НаКлиенте
Функция УстановленноДляВсех(ЭлементКоллекции)
	
	СоседниеЭлементы = ЭлементКоллекции.ПолучитьРодителя().ПолучитьЭлементы();
	Для Каждого ТекЭлемент Из СоседниеЭлементы Цикл
		Если ТекЭлемент.Выполнено <> ЭлементКоллекции.Выполнено Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Функция СнятоДляВсех(ЭлементКоллекции)
	
	СоседниеЭлементы = ЭлементКоллекции.ПолучитьРодителя().ПолучитьЭлементы();
	Для Каждого ТекЭлемент Из СоседниеЭлементы Цикл
		Если НЕ ТекЭлемент.Выполнено Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	Возврат Истина;
	
КонецФункции

&НаСервере
Процедура ПроектПриИзмененииНаСервере()
	
	ПараметрыСеанса.ТекущийПроект = Проект;
	ОбновитьДеревоВручную();
	
КонецПроцедуры


&НаКлиенте
Процедура ПроектПриИзменении(Элемент)
	ПроектПриИзмененииНаСервере();
	РаскрытьВетвиДерева();
КонецПроцедуры


&НаКлиенте
Процедура ОбновитьСписок(Команда)
	
	ОбновитьДеревоВручную();
	РаскрытьВетвиДерева();
	
КонецПроцедуры


&НаКлиенте
Процедура ДобавитьЗадачу(Команда)
	
	ПараметрыФормы = Новый Структура("Проект", Проект);
	ОткрытьФорму("Документ.Задача.ФормаОбъекта", ПараметрыФормы);
	ОбновитьДеревоВручную();
	РаскрытьВетвиДерева();
	
КонецПроцедуры


&НаКлиенте
Процедура ОткрытьЗадачу(Команда)
	
	ТекЗадача = Элементы.Дерево.ТекущиеДанные.Задача;
	П = Новый Структура("Ключ", ТекЗадача);
	Форма = ПолучитьФорму("Документ.Задача.ФормаОбъекта", П);
	Форма.Открыть();
	
КонецПроцедуры


&НаКлиенте
Процедура ДеревоВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекЗадача = Элементы.Дерево.ТекущиеДанные.Задача;
	П = Новый Структура("Ключ", ТекЗадача);
	Форма = ПолучитьФорму("Документ.Задача.ФормаОбъекта", П);
	Форма.Открыть();
	
КонецПроцедуры


&НаКлиенте
Процедура ДатаЗапросаПриИзменении(Элемент)
	ОбновитьДеревоВручную();
	РаскрытьВетвиДерева();
КонецПроцедуры


&НаСервере
Процедура ДобавитьБыструюЗадачуНаСервере()
	
	Если СокрЛП(врЗадачаНаим) <> "" Тогда
		ДокЗадача = Документы.Задача.СоздатьДокумент();
		ДокЗадача.Дата = ТекущаяДата();
		ДокЗадача.СрокЗадачи = врЗадачаСрок;
		ДокЗадача.ПроектГруппа = врЗадачаПроект;
		ДокЗадача.Состояние = Справочники.СостоянияЗадач.Создана;
		ДокЗадача.НаименованиеЗадачи = врЗадачаНаим;
		ДокЗадача.ОписаниеЗадачи = Новый ХранилищеЗначения(врЗадачаОпис);
		ДокЗадача.ПостановщикЗадачи = ПараметрыСеанса.ТекущийПользователь;
		
		Попытка
			ДокЗадача.Записать();
		Исключение
			Сообщить(ОписаниеОшибки());
		КонецПопытки; 
		врЗадачаНаим = "";
		врЗадачаОпис = "";
		врЗадачаПроект = Справочники.Проекты.ПустаяСсылка();
		врЗадачаСрок = Дата(1,1,1);
	КонецЕсли; 
	
КонецПроцедуры


&НаКлиенте
Процедура ДобавитьБыструюЗадачу(Команда)
	
	ДобавитьБыструюЗадачуНаСервере();
	ОбновитьДеревоВручную();
	РаскрытьВетвиДерева();
	
КонецПроцедуры


&НаСервере
Процедура УдалитьЗадачуНаСервере(Задача)

	Если ТипЗнч(Задача) = Тип("ДокументСсылка.Задача") Тогда
		ДокОбъект = Задача.ПолучитьОбъект();
		ДокОбъект.УстановитьПометкуУдаления(Истина);
	Иначе
		Сообщить("Нельзя удалять проект!");
	КонецЕсли; 
	
КонецПроцедуры


&НаКлиенте
Процедура УдалитьЗадачу(Команда)
	
	//Если Вопрос("Удалить задачу?", РежимДиалогаВопрос.ДаНет, 0) = КодВозвратаДиалога.Да Тогда
		ТекЗадача = Элементы.Дерево.ТекущиеДанные.Задача;
		УдалитьЗадачуНаСервере(ТекЗадача);
		ОбновитьДеревоВручную();
		РаскрытьВетвиДерева();
	//КонецЕсли; 
	
КонецПроцедуры


&НаКлиенте
Процедура ПроверитьПочту(Команда)
	
	Форма = ПолучитьФорму("Обработка.ПроверкаПочты.Форма");
	Форма.Открыть();
	ОбновитьДеревоВручную();
	РаскрытьВетвиДерева();
	
КонецПроцедуры


&НаКлиенте
Процедура ВыводитьЗавершенныеПриИзменении(Элемент)
	ОбновитьДеревоВручную();
	РаскрытьВетвиДерева();
КонецПроцедуры


&НаКлиенте
Процедура ДеревоСтатусовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекЗадача = Элементы.ДеревоСтатусов.ТекущиеДанные.Задача;
	П = Новый Структура("Ключ", ТекЗадача);
	Форма = ПолучитьФорму("Документ.Задача.ФормаОбъекта", П);
	Форма.Открыть();
	
КонецПроцедуры
